In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [ ]:
#Inner Join
pd.merge(employees,departments,on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [ ]:
#Left Join
pd.merge(employees, departments, on="DeptID", how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [ ]:
#Right Join
pd.merge(employees, departments, on="DeptID", how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [ ]:
#Outer join

pd.merge(employees, departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [10]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"score" : [43,232] })
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"age" : [3,2]})
#Vertical Concatination 
pd.concat([df1, df2])

      Name  score  age
0    Alice   43.0  NaN
1      Bob  232.0  NaN
0  Charlie    NaN  3.0
1    David    NaN  2.0

In [11]:
#Horizontal Concatination 
pd.concat([df1,df2],axis=1)

    Name  score     Name  age
0  Alice     43  Charlie    3
1    Bob    232    David    2